<template>
  <div id="director">
    <div class="card">
      <p>
        親愛的同學您好，
      </p>
      <p>
        首先要恭喜您進入本系就讀，我們很高興並歡迎您的加入。「國立高雄科技大學智慧商務系」，簡稱高智商，是全國首創的科系，這裡是可以成就您的與眾不同與實踐夢想的地方。
      </p>
      <p>
        本系原隸屬於高雄應用科技大學，前身為高雄工專，原名資訊管理系，迄今已經成立20年，秉持提高學生競爭能力的原則，我們一貫要求學生應兼具理論與實務經驗，盡心盡力培育國內優秀人才。從歷屆畢業系友的身上，我們看到充滿自信、希望與奮發向上所散發出來的光芒，我們也看到、聽到系友身邊的朋友、師長、企業與主管們，對系友們的讚揚、信賴與喜愛。這樣的例子在過去高應大時期的資管系是十分普遍的。但我們也深刻體會到，資訊管理是持續演進的學科，學生與老師都需要終身學習，才能跟上技術與產業的變化。
      </p>
      <p>
        囿於教育大環境下資訊管理專業人才漸趨飽和，已出現鈍化現象；加上全球智慧科技的興起，如何在台灣，加速各中小產業導入智慧科技，積極切入應用服務領域，推動發展具台灣實證場域與利基之創新智慧應用的生態體系成為當務之急。經過多次的內部討論，逐漸凝聚出「智慧商務系」不啻於當代熱門趨勢，更或許是一新學門產生的契機，本系願率先士卒，面對這個挑戰，於是本系於108學年度奉教育部核定更名為「智慧商務系」，您就是本系更名後招收的第二屆棟樑。展望未來高科大智商系，我們有信心，好的傳統會繼續延續，新增的課程主軸和內容，融合了智慧科技、資訊技術、大數據分析與管理知能，會讓學生具備更好的專業和價值，成為業界爭相延攬的人才。
      </p>
      <p>
        高科大智商系的特別在哪裡？我們的特別在於，勇於學習與創新，面對新科技與新機會的挑戰。我們的特別在於，欣賞同學們的與眾不同，啟發同學們的自我認識與自我發展，進而協助同學邁向成就自己與完成自己的道路。我們的特別在於，鼓勵同學不斷挑戰自己、實踐自己的夢想，能夠真正「樂學」、「勤學」。高科大智商系的特別在於，師生之間洋溢著溫暖、關懷與愛，這裡會讓您擁有充實、有趣與美好的大學生活。高科大智商系的特別在於，著重理論與實務並重的學習，同學們的學習不但能輕易地與產業接軌，同時也受到各研究所師長們的肯定。高科大智商系的同學「升學100%、就業100%」，不論您在大學畢業後選擇升學或就業，在高智商的訓練下，只要您肯用心學習、肯努力紮根，我們有信心讓您100%順利與理想銜接。
      </p>
      <p>
        大學是人生中最能自由探索自我，並有絕佳的體力去成就夢想的階段。在大學四年裡，學習讓自己獨立且正向思考，善用各種資源建立自我學習的能力，要求自己在團隊中的主動與互助，培養持續運動的好習慣，盡全力做好時間管理，讓自己除了在課業上精進專業智能外，還能參與系學會與社團，修習戀愛學分，嘗試各種可能的挑戰，如專業競賽與實習，國際志工，申請雙聯學位或交換生…等，只要你願意用心耕耘，高智商的大學四年，一定可以讓你脫胎換骨，找到人生努力的方向，成就理想。
      </p>
      <p>
        祝福您 擁有充實、健康和快樂的大學生活 國立高雄科技大學智慧商務系 系主任
      </p>
      <p class="sign">
        張添香 2020.8 系主任的話
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: "Director",
};
</script>

<style scopedd>
#director {
  padding: 19px 0;
  background: linear-gradient(35deg, #0fa, #37f);
}

.card {
  width: 70%;
  text-align: left;
  margin: 0 auto;
  padding: 15px;
  background: #fff;
  border: 1px rgba(0, 0, 0, 0.5) solid;
}

.sign {
  text-align: right;
}
</style>
