<template>
  <div id="history">
    <div class="active managers">
      <h3>{{ current.name }}</h3>
      <ul>
        <li
          v-for="(managerName, managerJob) in current.managers"
          :key="managerJob"
        >
          {{ managerJob }}－{{ managerName }}
        </li>
      </ul>
    </div>
    <h2>歷屆幹部</h2>
    <div
      class="managers"
      v-for="(historyObject, historyName) in history"
      :key="historyName"
    >
      <h3>{{ historyName }}</h3>
      <ul>
        <li
          v-for="(managerName, managerJob) in historyObject"
          :key="managerJob"
        >
          {{ managerJob }}－{{
            managerName.length > 1 ? managerName.join("、") : managerName[0]
          }}
        </li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  name: "History",
  data() {
    return {
      current: {
        name: "109級智慧商務系學會",
        managers: {
          會長: "劉聖龍",
          副會長: "黃翊涵",
          "家族&出納": "蘇靖雅",
          "服務&資訊": "蔡宗翰",
          文書: "王姵鈞",
          總務: "呂蘊哲",
          活動: "呂柏佑",
          公關: "周品瑩",
          美宣: "柯欣妤",
        },
      },
      history: {
        "108級資訊管理系學會": {
          會長: ["翁瑋志"],
          副會長兼公關: ["黃卉君"],
          "活動&服務": ["廖昱帆"],
          "美宣&家族": ["呂振銘"],
          資訊: ["曾厚荃"],
          文書: ["張恩銘"],
          出納: ["黃任遠"],
          總務: ["陳奕丞"],
        },
        "107級資訊管理系學會": {
          會長: ["杜家源"],
          副會長: ["王瓊蕙"],
          活動: ["王彥維"],
          "美宣&公關": ["李欣如"],
          資訊: ["陸聖惠"],
          文書: ["張揚"],
          家族: ["劉芸君"],
          服務: ["晁偉軒"],
          出納: ["郭宥彤"],
          總務: ["洪雪菱"],
        },
        "106級資訊管理系學會": {
          會長: ["洪心緯"],
          副會長: ["呂冠樺"],
          活動: ["張家綾", "姜承佑"],
          美宣: ["郭芳孜", "馬友軒"],
          資訊: ["廖建智"],
          文書: ["陳芊竹"],
          家族: ["鄭心愉"],
          公關: ["曾豐利"],
          服務: ["謝宣彥"],
          出納: ["施美妘"],
          總務: ["姜慧瀛"],
        },
        "105級資訊管理系學會": {
          會長: ["張家銘"],
          副會長: ["張瑜珊"],
          活動: ["李忠哲", "陳盈任"],
          美宣: ["陳維平", "陳嵩日"],
          資訊: ["王仕勳"],
          文書: ["蘇郁婷"],
          家族: ["黃宥樹"],
          公關: ["熊柔雅"],
          服務: ["陳峻偉"],
          出納: ["劉鈞庭"],
          總務: ["劉幼柔"],
        },
        "104級資訊管理系學會": {
          會長: ["王敏利"],
          副會長: ["郭彥承"],
          顧問: ["黃惠珊"],
          活動組長: ["莊慧琳"],
          美宣組長: ["張俊濤", "黃詩婷"],
          資訊組長: ["邱奕元"],
          文書組長: ["林辰晏"],
          家族組長: ["林聰祥"],
          公關組長: ["王毓汝"],
          服務組長: ["張德宇"],
          出納: ["周映璇"],
          總務: ["林子陽"],
          攝影: ["洪子惟"],
        },
        "103級資訊管理系學會": {
          會長: ["黃惠珊"],
          副會長: ["蔣定文"],
          顧問: ["林蕙伶"],
          行政組長: ["何宜倞"],
          活動組長: ["謝品賢", "褚上儀"],
          美宣組長: ["謝婷羽"],
          資訊組長: ["柯昱佑"],
          文書組長: ["蕭文婷"],
          家族組長: ["李宗致"],
          公關組長: ["洪誌廷"],
          服務組長: ["劉庭煟"],
          出納: ["邱利雯"],
          總務: ["王玉文"],
          攝影: ["王靖文"],
        },
        "102級資訊管理系學會": {
          會長: ["林蕙伶"],
          副會長: ["陳育鴻"],
          顧問: ["謝晉弘"],
          活動組長: ["王煥榮"],
          美宣組長: ["黃郁棨", "蔡政霖"],
          資訊組長: ["汪文啟"],
          文書組長: ["胡智凱"],
          家族組長: ["陳彥甫"],
          公關組長: ["陳朝昇"],
          服務組長: ["林少涵"],
          出納: ["石子宜"],
          總務: ["洪珮容"],
        },
        "101級資訊管理系學會": {
          會長: ["謝晉弘"],
          副會長: ["王峻麟"],
          顧問: ["蔡家斌"],
          活動組長: ["黃羿瑄"],
          美宣組長: ["楊青蓉"],
          資訊組長: ["蔡佳君"],
          文書組長: ["林玉方"],
          家族組長: ["宜德彥"],
          公關組長: ["陳憲龍"],
          服務組長: ["簡德瑋"],
          出納: ["王彬安"],
          總務: ["林家億"],
        },
        "100級資訊管理系學會": {
          會長: ["蔡家斌"],
          副會長: ["林柏宇"],
          顧問: ["何文浩"],
          活動組長: ["吳家嬈"],
          美宣組長: ["林璽文"],
          資訊組長: ["陳世鵬"],
          文書組長: ["廖瑋婷"],
          家族組長: ["謝松宇"],
          公關組長: ["邱立萍"],
          服務組長: ["劉聖文"],
          出納: ["陳仁彥"],
          總務: ["張巧欣"],
        },
        "99級資訊管理系學會": {
          會長: ["何文浩"],
          副會長: ["傅宇娟"],
          顧問: ["黃柏勛"],
          活動組長: ["張亦豐"],
          美宣組長: ["吳瑋婷"],
          資訊組長: ["廖彥豪"],
          文書組長: ["吳美辰"],
          公關組長: ["薛宇志"],
          服務組長: ["廖文銘"],
          出納: ["許千純"],
          總務: ["邱雯瑛"],
        },
        "98級資訊管理系學會": {
          會長: ["黃柏勳"],
          副會長: ["歐辰殷"],
          顧問: ["黃咨豪"],
          活動組長: ["張致賢"],
          活動副組長: ["張亦豐"],
          文宣組長: ["沉怡妏"],
          文宣副組長: ["黃琬意"],
          資訊組長: ["蔡秉孝"],
          資訊副組長: ["馮楚芸", "曾子麟"],
          公關組長: ["劉書宇"],
          公關副組長: ["傅于娟"],
          服務組長: ["黃聖銘"],
          出納: ["王倩儀"],
          總務: ["莊雅嵐"],
        },
        "97級資訊管理系學會": {
          會長: ["黃咨豪"],
          副會長: ["謝秉成"],
          顧問: ["徐民諺"],
          活動組長: ["鄭涵升"],
          活動副組長: ["劉厚欣"],
          美宣組長: ["羅康維"],
          美宣副組長: ["蘇韻文"],
          資訊組長: ["楊雅萍"],
          資訊副組長: ["林柏翰"],
          文書組長: ["歐辰殷"],
          公關組長: ["王詩雲"],
          服務組長: ["李玟書"],
          服務副組長: ["游佳翔"],
          出納: ["張惠雯"],
          總務: ["吳玟琪"],
        },
        "96級資訊管理系學會": {
          會長: ["徐民諺"],
          副會長: ["陳維婷"],
          顧問: ["潘志明"],
          活動組長: ["黃紹軒"],
          活動副組長: ["陳誼特"],
          美宣組長: ["林家瑋"],
          美宣副組長: ["蘇韻文"],
          資訊組長: ["馮連暉"],
          資訊副組長: ["林柏翰"],
          文書組長: ["張瑩琮"],
          文書副組長: ["汪芷茵"],
          公關組長: ["羅伊容"],
          公關副組長: ["陳韋州"],
          服務組長: ["王瑞欽"],
          服務副組長: ["黃有謙"],
          攝影組長: ["張進成"],
          攝影副組長: ["林忠慈"],
          出納: ["徐惠怡"],
          總務: ["柯政妏"],
        },
      },
    };
  },
};
</script>

<style scoped>
#history {
  display: flex;
  width: 100%;
  justify-content: center;
  flex-wrap: wrap;
  margin: 0 auto;
  text-align: center;
  font-family: "Noto Sans TC", sans-serif;
  background: linear-gradient(35deg, #0fa, #abc);
}

h2 {
  width: 100%;
  color: #fefefe;
}

.managers {
  width: 300px;
  padding: 10px;
  margin: 5px;
  color: rgba(15, 35, 35, 0.9);
  background: #fff;
  border-radius: 10px;
  box-shadow: 0px 8px 16px 0px rgba(0, 0, 0, 0.2);
}

.active {
  width: 100%;
  padding: 50px 0;
  color: rgb(255, 255, 255);
  background: rgb(102, 125, 125);
  margin: 10px 30px;
}

.managers ul {
  list-style: none;
  padding: 0;
  margin: 0 auto;
  margin-bottom: 30px;
}

@media screen and (max-width: 950px) {
  .managers {
    text-align: center;
  }

  .managers ul {
    list-style: none;
    padding: 0;
    margin: 0 auto;
    margin-bottom: 30px;
  }
}
</style>
